CSI API ETABS v1

# cSapModelPropRebar Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cPropRebar PropRebar { get; }

    ReadOnly Property PropRebar As cPropRebar
    	Get

    Dim instance As cSapModel
    Dim value As cPropRebar

    value = instance.PropRebar

    property cPropRebar^ PropRebar {
    	cPropRebar^ get ();
    }

    abstract PropRebar : cPropRebar with get

#### Property Value

Type: cPropRebar

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com